Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24FJ128GA310.h
#define _LCDSE2_SE43_POSITION                    0x0000000B
#define _LCDSE2_SE43_MASK                        0x00000800
#define _LCDSE2_SE43_LENGTH                      0x00000001

#define _LCDSE2_SE44_POSITION                    0x0000000C
#define _LCDSE2_SE44_MASK                        0x00001000
#define _LCDSE2_SE44_LENGTH                      0x00000001

#define _LCDSE2_SE45_POSITION                    0x0000000D
#define _LCDSE2_SE45_MASK                        0x00002000
#define _LCDSE2_SE45_LENGTH                      0x00000001

#define _LCDSE2_SE46_POSITION                    0x0000000E
#define _LCDSE2_SE46_MASK                        0x00004000
#define _LCDSE2_SE46_LENGTH                      0x00000001

#define _LCDSE2_SE47_POSITION                    0x0000000F
#define _LCDSE2_SE47_MASK                        0x00008000
#define _LCDSE2_SE47_LENGTH                      0x00000001

#define _LCDSE3_SE48_POSITION                    0x00000000
#define _LCDSE3_SE48_MASK                        0x00000001
#define _LCDSE3_SE48_LENGTH                      0x00000001

#define _LCDSE3_SE49_POSITION                    0x00000001
#define _LCDSE3_SE49_MASK                        0x00000002
#define _LCDSE3_SE49_LENGTH                      0x00000001

#define _LCDSE3_SE50_POSITION                    0x00000002
#define _LCDSE3_SE50_MASK                        0x00000004
#define _LCDSE3_SE50_LENGTH                      0x00000001

#define _LCDSE3_SE51_POSITION                    0x00000003
#define _LCDSE3_SE51_MASK                        0x00000008
#define _LCDSE3_SE51_LENGTH                      0x00000001

#define _LCDSE3_SE52_POSITION                    0x00000004
#define _LCDSE3_SE52_MASK                        0x00000010
#define _LCDSE3_SE52_LENGTH                      0x00000001

#define _LCDSE3_SE53_POSITION                    0x00000005
#define _LCDSE3_SE53_MASK                        0x00000020
#define _LCDSE3_SE53_LENGTH                      0x00000001

#define _LCDSE3_SE54_POSITION                    0x00000006
#define _LCDSE3_SE54_MASK                        0x00000040
#define _LCDSE3_SE54_LENGTH                      0x00000001

#define _LCDSE3_SE55_POSITION                    0x00000007
#define _LCDSE3_SE55_MASK                        0x00000080
#define _LCDSE3_SE55_LENGTH                      0x00000001

#define _LCDSE3_SE56_POSITION                    0x00000008
#define _LCDSE3_SE56_MASK                        0x00000100
#define _LCDSE3_SE56_LENGTH                      0x00000001

#define _LCDSE3_SE57_POSITION                    0x00000009
#define _LCDSE3_SE57_MASK                        0x00000200
#define _LCDSE3_SE57_LENGTH                      0x00000001

#define _LCDSE3_SE58_POSITION                    0x0000000A
#define _LCDSE3_SE58_MASK                        0x00000400
#define _LCDSE3_SE58_LENGTH                      0x00000001

#define _LCDSE3_SE59_POSITION                    0x0000000B
#define _LCDSE3_SE59_MASK                        0x00000800
#define _LCDSE3_SE59_LENGTH                      0x00000001

#define _LCDSE3_SE60_POSITION                    0x0000000C
#define _LCDSE3_SE60_MASK                        0x00001000
#define _LCDSE3_SE60_LENGTH                      0x00000001

#define _LCDSE3_SE61_POSITION                    0x0000000D
#define _LCDSE3_SE61_MASK                        0x00002000
#define _LCDSE3_SE61_LENGTH                      0x00000001

#define _LCDSE3_SE62_POSITION                    0x0000000E
#define _LCDSE3_SE62_MASK                        0x00004000
#define _LCDSE3_SE62_LENGTH                      0x00000001

#define _LCDSE3_SE63_POSITION                    0x0000000F
#define _LCDSE3_SE63_MASK                        0x00008000
#define _LCDSE3_SE63_LENGTH                      0x00000001

#define _LCDDATA0_S00C0_POSITION                 0x00000000
#define _LCDDATA0_S00C0_MASK                     0x00000001
#define _LCDDATA0_S00C0_LENGTH                   0x00000001

#define _LCDDATA0_S01C0_POSITION                 0x00000001
#define _LCDDATA0_S01C0_MASK                     0x00000002
#define _LCDDATA0_S01C0_LENGTH                   0x00000001

#define _LCDDATA0_S02C0_POSITION                 0x00000002
#define _LCDDATA0_S02C0_MASK                     0x00000004
#define _LCDDATA0_S02C0_LENGTH                   0x00000001

#define _LCDDATA0_S03C0_POSITION                 0x00000003
#define _LCDDATA0_S03C0_MASK                     0x00000008
#define _LCDDATA0_S03C0_LENGTH                   0x00000001

#define _LCDDATA0_S04C0_POSITION                 0x00000004
#define _LCDDATA0_S04C0_MASK                     0x00000010
#define _LCDDATA0_S04C0_LENGTH                   0x00000001

#define _LCDDATA0_S05C0_POSITION                 0x00000005
#define _LCDDATA0_S05C0_MASK                     0x00000020
#define _LCDDATA0_S05C0_LENGTH                   0x00000001

#define _LCDDATA0_S06C0_POSITION                 0x00000006
#define _LCDDATA0_S06C0_MASK                     0x00000040
#define _LCDDATA0_S06C0_LENGTH                   0x00000001

#define _LCDDATA0_S07C0_POSITION                 0x00000007
#define _LCDDATA0_S07C0_MASK                     0x00000080
#define _LCDDATA0_S07C0_LENGTH                   0x00000001

#define _LCDDATA0_S08C0_POSITION                 0x00000008
#define _LCDDATA0_S08C0_MASK                     0x00000100
#define _LCDDATA0_S08C0_LENGTH                   0x00000001

#define _LCDDATA0_S09C0_POSITION                 0x00000009
#define _LCDDATA0_S09C0_MASK                     0x00000200
#define _LCDDATA0_S09C0_LENGTH                   0x00000001

#define _LCDDATA0_S10C0_POSITION                 0x0000000A
#define _LCDDATA0_S10C0_MASK                     0x00000400
#define _LCDDATA0_S10C0_LENGTH                   0x00000001

#define _LCDDATA0_S11C0_POSITION                 0x0000000B
#define _LCDDATA0_S11C0_MASK                     0x00000800
#define _LCDDATA0_S11C0_LENGTH                   0x00000001

#define _LCDDATA0_S12C0_POSITION                 0x0000000C
#define _LCDDATA0_S12C0_MASK                     0x00001000
#define _LCDDATA0_S12C0_LENGTH                   0x00000001

#define _LCDDATA0_S13C0_POSITION                 0x0000000D
#define _LCDDATA0_S13C0_MASK                     0x00002000
#define _LCDDATA0_S13C0_LENGTH                   0x00000001

#define _LCDDATA0_S14C0_POSITION                 0x0000000E
#define _LCDDATA0_S14C0_MASK                     0x00004000
#define _LCDDATA0_S14C0_LENGTH                   0x00000001

